*** Graph Count

#+name: graph_count_example
#+BEGIN_SRC sparql
select ?graph  (count(*) as ?cnt) WHERE {
{
  graph ?graph { ?s ?p ?o. }
} UNION {
  bind ("default" as ?graph)
  {?s ?p ?o.}
}
} group by ?graph

#+END_SRC

#+RESULTS: graph_count_example
| graph                           |    cnt |
|---------------------------------+--------|
| http://experts.ucdavis.edu/oap/ | 410868 |
| http://vivoweb.org/             |      3 |
| http://experts.ucdavis.edu/fis/ |  20064 |
| http://experts.ucdavis.edu/iam/ |   3856 |
| http://experts.ucdavis.edu/     |   8511 |
| default                         | 442884 |

#+call: graph_count_example(graph="<http://experts.ucdavis.edu/oap/>")

The problem with the above, is that when you overwrite a variable that's an IRI,
and is in the select part of the statement, then you get an error.  The method
to use is to create *another* variable, and only use that to bind to the
variable in the statement you want to use.  The example below shows that
setup, where ~_graph_~ is shadowing the variables.  Another helpful part of
this, is that if your query is big, the shadow variables can be used to limit
the query when parameters aren't passed in.

#+name: graph_count
#+BEGIN_SRC sparql :noweb yes :var _graph_="<http://none>"
<<prefixes>>
select ?graph (count(*) as ?cnt) WHERE {
{
  bind($_graph_ as ?graph)
  graph ?graph { ?s $p ?o. }
} UNION {
  bind ("default" as ?graph)
  {?s ?p ?o.}
}
} group by ?graph

#+END_SRC

#+RESULTS: graph_count
| graph   |    cnt |
|---------+--------|
| default | 442884 |

So now, you can limit your query to a single graph.

#+call: graph_count(_graph_="<http://experts.ucdavis.edu/iam/>")

#+RESULTS:
| graph                           |    cnt |
|---------------------------------+--------|
| http://experts.ucdavis.edu/iam/ |   3856 |
| default                         | 442884 |


If you are clever,you can also break out of the box that the default values
defined.

#+call: graph_count(_graph_="?g")

#+RESULTS:
| graph                           |    cnt |
|---------------------------------+--------|
| http://experts.ucdavis.edu/oap/ | 410868 |
| http://vivoweb.org/             |      3 |
| http://experts.ucdavis.edu/fis/ |  20064 |
| http://experts.ucdavis.edu/iam/ |   3856 |
| http://experts.ucdavis.edu/     |   8511 |
| default                         | 442884 |

You are stll able to update the varibles we haven't thought about.  They may not
always work, but often will.

#+call: graph_count(_graph_="?g",p="rdf:type")

#+RESULTS:
| graph                               |    cnt |
|-------------------------------------+--------|
| http://experts.ucdavis.edu/oap/     | 291603 |
| http://experts.ucdavis.edu/private/ | 348140 |
| http://experts.ucdavis.edu/iam/     |   3666 |
| http://experts.ucdavis.edu/         |    139 |
| http://experts.ucdavis.edu/vocab/   | 471456 |


